In [ ]:
%load tutorial.db [rw]

In [ ]:
Create table If Not Exists Employee (empId int, name varchar(255), supervisor int, salary int)

In [ ]:
Create table If Not Exists Bonus (empId int, bonus int)

In [ ]:
insert into Employee (empId, name, supervisor, salary) values ('3', 'Brad', 'None', '4000')

In [ ]:
insert into Employee (empId, name, supervisor, salary) values ('1', 'John', '3', '1000')

In [ ]:
insert into Employee (empId, name, supervisor, salary) values ('2', 'Dan', '3', '2000')

In [ ]:
insert into Employee (empId, name, supervisor, salary) values ('4', 'Thomas', '3', '4000')

In [ ]:
insert into Bonus (empId, bonus) values ('2', '500')

In [ ]:
insert into Bonus (empId, bonus) values ('4', '2000')

In [ ]:
select * from employee

+-------+--------+------------+--------+
| empId | name   | supervisor | salary |
+-------+--------+------------+--------+
| 3     | Brad   | None       | 4000   |
+-------+--------+------------+--------+
| 1     | John   | 3          | 1000   |
+-------+--------+------------+--------+
| 2     | Dan    | 3          | 2000   |
+-------+--------+------------+--------+
| 4     | Thomas | 3          | 4000   |
+-------+--------+------------+--------+

In [ ]:
select * from bonus

+-------+-------+
| empId | bonus |
+-------+-------+
| 2     | 500   |
+-------+-------+
| 4     | 2000  |
+-------+-------+

## Write a solution to report the name and bonus amount of each employee with a bonus less than 1000.

Return the result table in any order.

In [ ]:
select name, bonus
from employee left join bonus
using (empId)
where bonus < 1000 or bonus is null

+------+-------+
| name | bonus |
+------+-------+
| Brad |       |
+------+-------+
| John |       |
+------+-------+
| Dan  | 500   |
+------+-------+